Before merge, verify that all the following plans are correct. They will be applied as-is after the merge.

#### Terraform plans
<details><summary>pl-strflt</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # github_repository_collaborator.this["github-mgmt:galargh"] will be destroyed
  # (because key ["github-mgmt:galargh"] is not in for_each map)
  - resource "github_repository_collaborator" "this" {
      - id         = "github-mgmt:galargh" -> null
      - permission = "admin" -> null
      - repository = "github-mgmt" -> null
      - username   = "galargh" -> null
    }

  # github_repository_file.this["github-mgmt/CODEOWNERS"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      ~ content             = <<-EOT
          - *       @galargh
          + # The ipdx team is responsible for GitHub Management maintenance
          + * @pl-strflt/ipdx
          + 
          + # The github-mgmt stewards team is responsible for triaging/reviewing configuration change requests
          + # The ipdx team is added here temporarily to witness use patterns in github-mgmt
          + /github/ipfs.yml @pl-strflt/github-mgmt-stewards @pl-strflt/ipdx
        EOT
        id                  = "github-mgmt/CODEOWNERS"
        # (9 unchanged attributes hidden)
    }

  # github_team.this["github-mgmt stewards"] will be created
  + resource "github_team" "this" {
      + create_default_maintainer = false
      + description               = "Users that are effectively org admins"
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "github-mgmt stewards"
      + node_id                   = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # github_team_membership.this["github-mgmt stewards:galargh"] will be created
  + resource "github_team_membership" "this" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = (known after apply)
      + username = "galargh"
    }

  # github_team_membership.this["github-mgmt stewards:laurentsenta"] will be created
  + resource "github_team_membership" "this" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = (known after apply)
      + username = "laurentsenta"
    }

  # github_team_repository.this["github-mgmt stewards:github-mgmt"] will be created
  + resource "github_team_repository" "this" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "github-mgmt"
      + team_id    = (known after apply)
    }

  # github_team_repository.this["ipdx:github-mgmt"] will be updated in-place
  ~ resource "github_team_repository" "this" {
        id         = "5869006:github-mgmt"
      ~ permission = "triage" -> "maintain"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.this["w3dt-stewards:github-mgmt"] will be destroyed
  # (because key ["w3dt-stewards:github-mgmt"] is not in for_each map)
  - resource "github_team_repository" "this" {
      - etag       = "W/\"6b590885c759205d380a7d2d0f3ab56971f8d5ceb69d2b00f09b10500f3d6f42\"" -> null
      - id         = "6319388:github-mgmt" -> null
      - permission = "maintain" -> null
      - repository = "github-mgmt" -> null
      - team_id    = "6319388" -> null
    }

Plan: 4 to add, 2 to change, 2 to destroy.
```

</details>
<!-- Sticky Pull Request Comment -->